"use strict";


// const result = confirm("Вы здесь?"); - задать вопрос пользователю

// const answer = +prompt("Вам есть 18 лет?",""); - задать вопрос пользователю с возможностью ответить, + - обозначает преоброзования формата
// унарный + который переобразует формат
//-------------------------------------------------------------------------------------------------------------------------------------
// const answers = [];

// answers[0]= prompt('Как ваше Имя?','');
// answers[1]= prompt('Как ваше Фамилия?','');
// answers[2]= prompt('Сколько вам лет?','');
//--------------------------------------------------Работа с массивом с помощью promt

// const category = 'toys';

// console.log(`htps://someurl.com/${category}/5`);


// const arr = ['Alex'];

// alert(`Привет, ${arr[0]}`);

// console.log('arr '+'- object');

// let incr = 10,
//     decr = 10;

// // incr++;    // постфикстная - показывает при выводе элемнта старое значение, после увеличивает или уменьшает
// // --decr;    // префиксная  - сначала делает дейтвие потом выводит
// console.log(incr++);
// console.log(decr--);

// console.log(5%2); // отсаток от деления 

// console.log(2 + 2 * 2 !== '6'); // == - сравнение двух элементов(любого формата), === - строгое сравнение элементов , 
// // && - и - если оба правдивы то true, если один из элементов лож то false
// // || - или - если один из элементов true то результат true
// // ! - отрицание
// const isChecked = true,
//       isClose = false;

// console.log(isChecked || !isClose); 

const numberOfFilms = prompt("Сколько фильмов вы уже смотрели?","");

console.log(numberOfFilms);

const personalMovieDB = {
    count: numberOfFilms,
    movies: 
};
      
